app/views/milestones/edit.html.erb

SELECT "locations".* FROM "locations" INNER JOIN "milestones" ON "locations"."id" = "milestones"."location_id" INNER JOIN "contacts" ON "milestones"."contact_id" = "contacts"."id" WHERE "contacts"."user_id" = $1  [["user_id", 3]]
---
      <div class="dropdown-text col-md-6">
        <% location_array = @user.locations.map {|l| l.title} %>

SELECT "tags".* FROM "tags" INNER JOIN "subjects" ON "tags"."id" = "subjects"."tag_id" INNER JOIN "milestones" ON "subjects"."milestone_id" = "milestones"."id" INNER JOIN "contacts" ON "milestones"."contact_id" = "contacts"."id" WHERE "contacts"."user_id" = $1  [["user_id", 3]]
---
      <div class="dropdown-text col-md-6">
      <% tags_array = @user.tags.map {|t| t.title} %>