app/views/milestones/index.html.erb

                <p class="milestone-tags">
                  <% @contact.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "subjects" ON "tags"."id" = "subjects"."tag_id" INNER JOIN "milestones" ON "subjects"."milestone_id" = "milestones"."id" WHERE "milestones"."contact_id" = $1  [["contact_id", 8]]

                <br>
                <% @contact.locations.each do |location| %>
---
SELECT "locations".* FROM "locations" INNER JOIN "milestones" ON "locations"."id" = "milestones"."location_id" WHERE "milestones"."contact_id" = $1  [["contact_id", 8]]

            <p class="milestone-tags">
              <% milestone.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "subjects" ON "tags"."id" = "subjects"."tag_id" WHERE "subjects"."milestone_id" = $1  [["milestone_id", 35]]

      <div>
        <% unless milestone.assigments.empty? %>
---
SELECT "assigments".* FROM "assigments" WHERE "assigments"."milestone_id" = $1  [["milestone_id", 34]]
SELECT  1 AS one FROM "assigments" WHERE "assigments"."milestone_id" = $1 LIMIT $2  [["milestone_id", 35], ["LIMIT", 1]]

        <% end %>
        <% milestone.assigments.each do |assigment|%>
---
SELECT "assigments".* FROM "assigments" WHERE "assigments"."milestone_id" = $1  [["milestone_id", 35]]