app/controllers/milestones_controller.rb

SELECT "milestones".* FROM "milestones" WHERE "milestones"."contact_id" = $1 ORDER BY created_at DESC  [["contact_id", 4]]
SELECT "assigments".* FROM "assigments" WHERE "assigments"."milestone_id" = $1  [["milestone_id", 34]]
---
  def index
    @milestones = Milestone.where(contact_id: find_contact.id ).order("created_at DESC")
    @contact = find_contact
    @locations = Location.all
    @assigments = Assigment.all

SELECT "locations".* FROM "locations"
INSERT INTO "locations" ("title", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Who knows"], ["user_id", 3], ["created_at", "2018-10-26 16:06:08.833084"], ["updated_at", "2018-10-26 16:06:08.833084"]]
INSERT INTO "milestones" ("contact_id", "created_at", "updated_at", "contact_type", "location_id", "note", "last_location", "last_tag_two", "last_tag", "assigment_one", "assigment_two") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
SELECT "tags".* FROM "tags"
SELECT  1 AS one FROM "locations" WHERE "locations"."title" = $1 LIMIT $2  [["title", "Who knows"], ["LIMIT", 1]]
SELECT  1 AS one FROM "tags" WHERE "tags"."title" = $1 AND "tags"."id" != $2 LIMIT $3  [["title", "work"], ["id", 31], ["LIMIT", 1]]
INSERT INTO "tags" ("title", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Test"], ["user_id", 3], ["created_at", "2018-10-26 16:06:08.852236"], ["updated_at", "2018-10-26 16:06:08.852236"]]
INSERT INTO "subjects" ("tag_id", "milestone_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["tag_id", 31], ["milestone_id", 36], ["created_at", "2018-08-21 11:40:18.075799"], ["updated_at", "2018-08-21 11:40:18.075799"]]
---
  def create
    @milestone = Milestone.new(milestone_params)
    @milestone.contact = @contact

      flash[:success] = "Your milestone has been set!"
      @locations = Location.all
      @have_location = false
      if not @milestone.last_location.blank?
          @locations.each do |l|
            if l.title == @milestone.last_location
              @milestone.location= l
              @have_location = true
              @milestone.save!
            end
          end
          if @have_location == false
            @location = Location.new(title:@milestone.last_location, user_id:@contact.user_id)
            if @location.save!
              @milestone.location = @location
              @milestone.save!
            end
          end
      end
    if @milestone.save!
      @tags = Tag.all

    if not @milestone.last_tag.blank?
      @have_first_tag = false
      if @milestone.last_tag != "Choose_tag"
        @tags.each do |t|
          if t.title == @milestone.last_tag
            @subject1 = Subject.new(milestone_id:@milestone.id, tag_id:t.id)
            @have_first_tag = true
            @subject1.save!

INSERT INTO "tags" ("title", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Test"], ["user_id", 3], ["created_at", "2018-10-26 16:06:08.852236"], ["updated_at", "2018-10-26 16:06:08.852236"]]
INSERT INTO "subjects" ("tag_id", "milestone_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["tag_id", 34], ["milestone_id", 38], ["created_at", "2018-10-26 16:06:08.864741"], ["updated_at", "2018-10-26 16:06:08.864741"]]
---
        end
        if @have_first_tag == false
          @tag1 = Tag.new(title:@milestone.last_tag, user_id:@contact.user_id)
          @tag1.save!
          @subject1 = Subject.new(milestone_id:@milestone.id, tag_id:@tag1.id)
          @subject1.save!

INSERT INTO "subjects" ("tag_id", "milestone_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["tag_id", 32], ["milestone_id", 36], ["created_at", "2018-08-21 11:40:18.086189"], ["updated_at", "2018-08-21 11:40:18.086189"]]
---
          if t.title == @milestone.last_tag_two
            @subject2 = Subject.new(milestone_id:@milestone.id, tag_id:t.id)
            @have_second_tag = true
            @subject2.save!

SELECT "assigments".* FROM "assigments" WHERE "assigments"."milestone_id" = $1  [["milestone_id", 36]]
---
      end
    end
    assignment1_exist = false
    if not @milestone.assigment_one.empty?
      @milestone.assigments.each do |assignment|

INSERT INTO "assigments" ("title", "milestone_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "library"], ["milestone_id", 36], ["created_at", "2018-08-21 11:40:18.092656"], ["updated_at", "2018-08-21 11:40:18.092656"]]
---
      end
      if assignment1_exist == false
        @assigment1 = Assigment.new(milestone_id:@milestone.id, title:@milestone.assigment_one)
        @assigment1.save!

INSERT INTO "assigments" ("title", "milestone_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "get money"], ["milestone_id", 36], ["created_at", "2018-08-21 11:40:18.099512"], ["updated_at", "2018-08-21 11:40:18.099512"]]
---
      end
      if assignment2_exist == false
        @assigment2 = Assigment.new(milestone_id:@milestone.id, title:@milestone.assigment_two)
        @assigment2.save!

UPDATE "milestones" SET "last_location" = $1, "last_tag_two" = $2, "last_tag" = $3, "updated_at" = $4 WHERE "milestones"."id" = $5  [["last_location", "office-meeting"], ["last_tag_two", "Choose-tag"], ["last_tag", "Choose-tag"], ["updated_at", "2018-10-26 15:57:09.214149"], ["id", 37]]
SELECT "subjects".* FROM "subjects" WHERE "subjects"."milestone_id" = $1  [["milestone_id", 37]]
SELECT "tags".* FROM "tags"
SELECT  1 AS one FROM "tags" WHERE "tags"."title" = $1 AND "tags"."id" != $2 LIMIT $3  [["title", "Choose-tag"], ["id", 33], ["LIMIT", 1]]
---
    def update
      @milestone.update(milestone_params)
        flash[:success] = "Your milestone has been set!"
        @locations = Location.all
        if not @milestone.last_location.blank?
            if @milestone.last_location != @milestone.location.title
              @have_location = false
              @locations.each do |l|
                if l.title == @milestone.last_location
                  @milestone.location = l
                  @have_location = true
                  @milestone.save!
                end
              end
              if @have_location == false
                @location = Location.new(title:@milestone.last_location, user_id:@contact.user_id)
                if @location.save!
                  @milestone.location = @location
                  @milestone.save!
                end
              end
            end
        end
      @milestones = Milestone.all
      if @milestone.save!
        @subject1 = @milestone.subjects[0]
        @subject2 = @milestone.subjects[1]
        @subjects = Subject.all
        @tags = Tag.all

      if not @milestone.last_tag.blank?

SELECT "tags".* FROM "tags" INNER JOIN "subjects" ON "tags"."id" = "subjects"."tag_id" WHERE "subjects"."milestone_id" = $1  [["milestone_id", 37]]
---
            if t.title == @milestone.last_tag
              @first_tag_exist = true
              @tag_id1 = t.id
              @milestone.tags.each do |mt|

INSERT INTO "subjects" ("tag_id", "milestone_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["tag_id", 33], ["milestone_id", 37], ["created_at", "2018-10-26 15:57:09.239722"], ["updated_at", "2018-10-26 15:57:09.239722"]]
INSERT INTO "tags" ("title", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Choose-tag"], ["user_id", 3], ["created_at", "2018-10-26 15:57:09.227074"], ["updated_at", "2018-10-26 15:57:09.227074"]]
---
          end
          if (@first_tag_exist == true && @has_first_tag == false)
            @new_subject1 = Subject.new(milestone_id:@milestone.id, tag_id:@tag_id1)
            @new_subject1.save!

INSERT INTO "tags" ("title", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Choose-tag"], ["user_id", 3], ["created_at", "2018-10-26 15:57:09.227074"], ["updated_at", "2018-10-26 15:57:09.227074"]]
INSERT INTO "subjects" ("tag_id", "milestone_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["tag_id", 33], ["milestone_id", 37], ["created_at", "2018-10-26 15:57:09.239722"], ["updated_at", "2018-10-26 15:57:09.239722"]]
---
          end
          if @first_tag_exist == false
            @tag1 = Tag.new(title:@milestone.last_tag, user_id:@contact.user_id)
            @tag1.save!
            @new_subject1 = Subject.new(milestone_id:@milestone.id, tag_id:@tag1.id)
            @new_subject1.save!

DELETE FROM "milestones" WHERE "milestones"."id" = $1  [["id", 37]]
---
  def destroy
    @milestone.destroy

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def find_contact
    @contact = Contact.find(params[:contact_id])

SELECT  "milestones".* FROM "milestones" WHERE "milestones"."id" = $1 LIMIT $2  [["id", 37], ["LIMIT", 1]]
---
  def find_milestone
   @milestone = Milestone.find(params[:id])